<a href="https://colab.research.google.com/github/santhoshbvsrk/CapstoneProjects/blob/main/DataAnalytics_CDF/InsaidTelecom_CDFCapstone.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

 

*  As the dataset is huge, we'll zip it, upload the zip file to google drive and mount your google drive to colab, unzip it to access data from your colab.


*   Import the drive package from google.colab library to mount your google drive on to google colab.

In [1]:
from google.colab import drive
drive.mount ('/content/gdrive')

Mounted at /content/gdrive



*   Once mounting is completed, mention the path of your zip file which contains the data to read.

In [2]:
!unzip gdrive/My\ Drive/CDF_Capstone_Project1/events_data.zip

Archive:  gdrive/My Drive/CDF_Capstone_Project1/events_data.zip
  inflating: events_data.csv



*   Once mounting and unzipping is completed successfully, you should be able to see the zip file contains in your colab folder.

In [3]:
import pandas as pd 
import numpy as np

In [4]:
events_data_df=pd.read_csv("events_data.csv")
events_data_df.head()

   event_id     device_id            timestamp  ...   latitude      city       state
0   2765368  2.973348e+18  2016-05-07 22:52:05  ...  28.730140     Delhi       Delhi
1   2955066  4.734221e+18  2016-05-01 20:44:16  ...  22.660325  Calcutta  WestBengal
2    605968 -3.264500e+18  2016-05-02 14:23:04  ...  28.757906     Delhi       Delhi
3    448114  5.731369e+18  2016-05-03 13:21:16  ...  13.153332   Chennai   TamilNadu
4    665740  3.388880e+17  2016-05-06 03:51:05  ...  23.842609    Bokaro   Jharkhand

[5 rows x 7 columns]

In [5]:
events_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
 #   Column     Dtype
---  ------     -----
 0   event_id   int64
 1   device_id  float64
 2   timestamp  object
 3   longitude  float64
 4   latitude   float64
 5   city       object
 6   state      object
dtypes: float64(3), int64(1), object(3)
memory usage: 173.7+ MB

Installing mysql connector for python

In [7]:
pip install mysql-connector-python-rf

Collecting mysql-connector-python-rf
  Downloading https://files.pythonhosted.org/packages/21/79/2ff01ab7aa08db3a16b70b990c579c1024c6b2a734263cc7513a758867de/mysql-connector-python-rf-2.2.2.tar.gz (11.9MB)
     |████████████████████████████████| 11.9MB 5.5MB/s
Building wheels for collected packages: mysql-connector-python-rf
  Building wheel for mysql-connector-python-rf (setup.py) ... done
  Created wheel for mysql-connector-python-rf: filename=mysql_connector_python_rf-2.2.2-cp37-cp37m-linux_x86_64.whl size=249456 sha256=590e6a04454095c5b94adb35990b9838f4f32c5456d4c1d1462f830f1413dcdb
  Stored in directory: /root/.cache/pip/wheels/87/58/fb/d95c84fad7e1bebfed324c13e107ebb08e1997c9226532859a
Successfully built mysql-connector-python-rf
Installing collected packages: mysql-connector-python-rf
Successfully installed mysql-connector-python-rf-2.2.2

import package to connect to mysql and loading data from tables to dataframes

In [8]:
import mysql.connector

#this is to connect to mysql database
mydb = mysql.connector.connect(
  host="cpanel.insaid.co",
  user="student",
  password="student",
  database="Capstone1"
)

#declaring a cursor variable of database to hold data of a specific table
mycursor = mydb.cursor()

#mycursor variable holds the entire data from gender_age_train table
mycursor.execute("SELECT * FROM gender_age_train")

#using fetchall function to get data from cursor and populating in another variable
myresult = mycursor.fetchall()

#inserting table data from variable into a dataframe
gender_age_train_df = pd.DataFrame(myresult,columns=['device_id','Gender','Age','Age_Group'])

#mycursor variable holds the entire data from phone_brand_device_model table
mycursor.execute("SELECT * FROM phone_brand_device_model")

#using fetchall function to get data from cursor and populating in another variable, this overwrites data from previous load
myresult = mycursor.fetchall()

#inserting table data from variable into a dataframe
phone_brand_device_model_df = pd.DataFrame(myresult,columns=['device_id','Brand','Model'])

#printing sample data from the dataframes
print("Data from Gender_Age_Train Table")
print("---------------------------------")
print(gender_age_train_df.head())
print("**************************************")
print("\n")
print("Data from Phone_Brand_Device_Model Table")
print("-----------------------------------------")
print(phone_brand_device_model_df.head())
print("**************************************")

Data from Gender_Age_Train Table
---------------------------------
             device_id Gender  Age Age_Group
0 -8076087639492063270      M   35    M32-38
1 -2897161552818060146      M   35    M32-38
2 -8260683887967679142      M   35    M32-38
3 -4938849341048082022      M   30    M29-31
4   245133531816851882      M   30    M29-31
**************************************


Data from Phone_Brand_Device_Model Table
-----------------------------------------
             device_id Brand    Model
0  1877775838486905855  vivo      Y13
1 -3766087376657242966    小米     V183
2 -6238937574958215831  OPPO      R7s
3  8973197758510677470    三星    A368t
4 -2015528097870762664    小米  红米Note2
**************************************

In [9]:
events_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
 #   Column     Dtype
---  ------     -----
 0   event_id   int64
 1   device_id  float64
 2   timestamp  object
 3   longitude  float64
 4   latitude   float64
 5   city       object
 6   state      object
dtypes: float64(3), int64(1), object(3)
memory usage: 173.7+ MB

In [10]:
gender_age_train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74645 entries, 0 to 74644
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   device_id  74645 non-null  int64
 1   Gender     74645 non-null  object
 2   Age        74645 non-null  int64
 3   Age_Group  74645 non-null  object
dtypes: int64(2), object(2)
memory usage: 2.3+ MB

In [11]:
phone_brand_device_model_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   device_id  87726 non-null  int64
 1   Brand      87726 non-null  object
 2   Model      87726 non-null  object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

Checking how many device_id from gender_age_train_df are present in events_data_df

In [12]:
count=0
for id in gender_age_train_df['device_id']:
  events_data_df[events_data_df['device_id']==id]
  count=count+1
  
print("Number of DeviceIds common in EventsData & GenderAgeTrain are: ",count)

Number of DeviceIds common in EventsData & GenderAgeTrain are:  74645

From this we can say that all the device_id present in gender_age_train_df are present in events_data_df

In [13]:
count=0
for id in phone_brand_device_model_df['device_id']:
  events_data_df[events_data_df['device_id']==id]
  count=count+1
  
print("Number of DeviceIds common in EventsData & PhoneBrandDeviceModel are: ",count)

Number of DeviceIds common in EventsData & PhoneBrandDeviceModel are:  87726

From this we can say that all the device_id present in phone_brand_device_model_df are present in events_data_df

In [35]:
events_data_df['device_id'].value_counts(ascending=False)

 5.536513e+18    33426
-4.792366e+18    14568
 4.428421e+17     6731
-6.242501e+18     4150
-8.340098e+18     3973
                 ...
 1.811198e+18        1
-6.853438e+18        1
-6.429648e+17        1
 4.889676e+18        1
-4.243579e+18        1
Name: device_id, Length: 60865, dtype: int64

In [36]:
gender_age_train_df['device_id'].value_counts(ascending=False)

 2257159551899998892    1
-5859103589956090399    1
-1824840104697287357    1
 4676982795249941605    1
-4498445842577775035    1
                       ..
 1973456509863984167    1
-6615755711424206170    1
 7038954467068358105    1
 452720611336482113     1
 8954493586702958652    1
Name: device_id, Length: 74645, dtype: int64

In [37]:
phone_brand_device_model_df['device_id'].value_counts(ascending=False)

 4297421574931963628    1
-6683447465042266790    1
-2025398450464681486    1
-2104282943635898244    1
-1079794670707116889    1
                       ..
-8243778303410121446    1
 4963348570238922413    1
 2156147271872893762    1
-3354736606620104853    1
 8954493586702958652    1
Name: device_id, Length: 87726, dtype: int64

In [38]:
gender_age_train_df['Gender'].value_counts()

M    47904
F    26741
Name: Gender, dtype: int64

In [41]:
phone_brand_device_model_df['Brand'].value_counts(ascending=False)

小米      21645
三星      19211
华为      15181
vivo     7596
OPPO     6717
        ...
欧沃          1
瑞高          1
E人E本        1
世纪星         1
西门子         1
Name: Brand, Length: 116, dtype: int64

Merging Dataframes on device_id to create a single dataframe which contains customer age, gender, mobile brand and model

In [ ]:
device_data_df=pd.merge(events_data_df,gender_age_train_df,on='device_id',how='left')
device_data_df.fillna(0,inplace=True)
device_data_df

         event_id     device_id            timestamp  ...  Gender   Age Age_Group
0         2765368  2.973348e+18  2016-05-07 22:52:05  ...       M  35.0    M32-38
1         2955066  4.734221e+18  2016-05-01 20:44:16  ...       0   0.0         0
2          605968 -3.264500e+18  2016-05-02 14:23:04  ...       0   0.0         0
3          448114  5.731369e+18  2016-05-03 13:21:16  ...       0   0.0         0
4          665740  3.388880e+17  2016-05-06 03:51:05  ...       0   0.0         0
...           ...           ...                  ...  ...     ...   ...       ...
3252945   2687452 -1.937028e+18  2016-05-07 23:33:14  ...       0   0.0         0
3252946   1051580  3.345851e+18  2016-05-03 05:13:30  ...       0   0.0         0
3252947   1316227 -6.406040e+18  2016-05-01 16:03:28  ...       0   0.0         0
3252948    381262 -2.920741e+18  2016-05-05 17:22:36  ...       0   0.0         0
3252949    522592  3.212750e+18  2016-05-07 17:34:18  ...       0   0.0         0

[3252950 rows x 10 columns]

In [ ]:
device_data_df=pd.merge(device_data_df,phone_brand_device_model_df,on='device_id',how='left')
device_data_df.fillna(0,inplace=True)
device_data_df

         event_id     device_id            timestamp  ...  Age_Group  Brand  Model
0         2765368  2.973348e+18  2016-05-07 22:52:05  ...     M32-38     优米  UIMI3
1         2955066  4.734221e+18  2016-05-01 20:44:16  ...          0      0      0
2          605968 -3.264500e+18  2016-05-02 14:23:04  ...          0      0      0
3          448114  5.731369e+18  2016-05-03 13:21:16  ...          0      0      0
4          665740  3.388880e+17  2016-05-06 03:51:05  ...          0      0      0
...           ...           ...                  ...  ...        ...    ...    ...
3252945   2687452 -1.937028e+18  2016-05-07 23:33:14  ...          0      0      0
3252946   1051580  3.345851e+18  2016-05-03 05:13:30  ...          0      0      0
3252947   1316227 -6.406040e+18  2016-05-01 16:03:28  ...          0      0      0
3252948    381262 -2.920741e+18  2016-05-05 17:22:36  ...          0      0      0
3252949    522592  3.212750e+18  2016-05-07 17:34:18  ...          0      0      0

[3252950 rows x 12 columns]

In [ ]:
device_data_df[device_data_df['Gender']!=0]

         event_id     device_id            timestamp  ...  Age_Group  Brand    Model
0         2765368  2.973348e+18  2016-05-07 22:52:05  ...     M32-38     优米    UIMI3
73        1355198  2.973348e+18  2016-05-01 01:35:45  ...     M32-38     优米    UIMI3
75        1700164  1.447049e+16  2016-05-07 22:42:50  ...     F33-42     华为      荣耀7
373       1836426  3.872522e+18  2016-05-01 20:29:14  ...       M22-     酷派     8702
628       2319906 -4.973076e+16  2016-05-01 10:31:53  ...     M29-31     三星    K860i
...           ...           ...                  ...  ...        ...    ...      ...
3251331   1586578  2.036140e+17  2016-05-04 17:53:28  ...       M39+     小米  红米Note2
3251469   2221680 -5.375128e+17  2016-05-06 21:10:53  ...     M27-28     华为     荣耀4A
3251848   1002673  2.728779e+16  2016-05-06 01:20:30  ...     M23-26     小米       红米
3252632    221124  8.492297e+15  2016-05-03 09:04:15  ...     M27-28     小米  note顶配版
3252635   1076223  1.337418e+18  2016-05-03 23:44:37  ...       F43+     小米      红米2

[16982 rows x 12 columns]

In [ ]:
device_data_df[device_data_df['Brand']!=0]

         event_id     device_id            timestamp  ...  Age_Group  Brand    Model
0         2765368  2.973348e+18  2016-05-07 22:52:05  ...     M32-38     优米    UIMI3
73        1355198  2.973348e+18  2016-05-01 01:35:45  ...     M32-38     优米    UIMI3
75        1700164  1.447049e+16  2016-05-07 22:42:50  ...     F33-42     华为      荣耀7
373       1836426  3.872522e+18  2016-05-01 20:29:14  ...       M22-     酷派     8702
628       2319906 -4.973076e+16  2016-05-01 10:31:53  ...     M29-31     三星    K860i
...           ...           ...                  ...  ...        ...    ...      ...
3251331   1586578  2.036140e+17  2016-05-04 17:53:28  ...       M39+     小米  红米Note2
3251469   2221680 -5.375128e+17  2016-05-06 21:10:53  ...     M27-28     华为     荣耀4A
3251848   1002673  2.728779e+16  2016-05-06 01:20:30  ...     M23-26     小米       红米
3252632    221124  8.492297e+15  2016-05-03 09:04:15  ...     M27-28     小米  note顶配版
3252635   1076223  1.337418e+18  2016-05-03 23:44:37  ...       F43+     小米      红米2

[16982 rows x 12 columns]